/*!
 ***************************************************************************************
 *
 *  Copyright ? 2017-2018 yifneg. All Rights Reserved.
 *
 * \file      mqtt_aliyun_conf.c
 * \author    yifeng
 * \version   1.0
 * \date      2023年3月14日
 * \brief     mqtt配置源程序
 *
 *--------------------------------------------------------------------------------------
 * \attention
 *
 *
 ***************************************************************************************
 */

/*****************************************************************************************
 change history: 
    1.date  : 2023年3月14日
      author: yifeng
      change: create file

*****************************************************************************************/


/*========================================================================================
                                 本源程序包括的头文件                                     
建议：包含本项目的文件使用 #include "文件名.扩展名"，                                   
      包含系统库的文件使用 #include <文件名.扩展名> 。                                    
========================================================================================*/
#include "mqtt_aliyun_conf.h"
#include <stdio.h>
#include <string.h>
#include "iniparser.h"


/*=======================================================================================
下面这三条指令是用于区分编译系统为 C++ 或 C 的预处理指令。                               
"__cplusplus" 为 C++ 预处理器名字，这三条指令表明接在其下面的那些指令为 C 程序特征.      
=======================================================================================*/
#ifdef __cplusplus
extern "C" {
#endif


/*=======================================================================================
                            本源程序文件内部使用的字符化常数定义                         
=======================================================================================*/
/*---------------------------------------------------------------------------------------
的字符化常数定义：
----------------------------------------------------------------------------------------*/


/*=======================================================================================
                             本源程序文件内部使用的函数原型声明                          
=======================================================================================*/


/*=======================================================================================
                       本源程序文件内部使用的局部常量、字符化常数定义                    
=======================================================================================*/
/*---------------------------------------------------------------------------------------
的局部常量、字符化常数定义：
---------------------------------------------------------------------------------------*/


/*=======================================================================================
                                         全局常量定义                                    
=======================================================================================*/
/*---------------------------------------------------------------------------------------
的全局常量定义：
---------------------------------------------------------------------------------------*/


/*=======================================================================================
                                         全局变量定义                                    
=======================================================================================*/
/*---------------------------------------------------------------------------------------
的全局变量定义：
---------------------------------------------------------------------------------------*/


/*=======================================================================================
                             本源程序文件内部使用的局部变量定义                          
=======================================================================================*/




/*
*****************************************************************************************
                            　       程序指令代码清单
*****************************************************************************************
*/


/*!
 * \fn     gain_mqtt_conf
 * \brief   配置
 *          
 * \param  [in] char *ini_path   #
 * \param  [in] st_mqtt *mqtt    #
 * \param  [in] int type         #
 * 
 * \retval int
 */
int gain_mqtt_conf(char *ini_path,st_mqtt *mqtt)
{
  dictionary        *ini=NULL;
  const char        *hostname;
  const char        *username;
  int               port;
  const char        *passwd;
  const char        *clientid;
  const char        *pub_topic;
  const char        *sub_topic;
  int                Qos;

  if(!ini_path || !mqtt)
  {
    printf("invail input parameter in %s\n", __FUNCTION__) ;
    return -1 ;
  }
  
  ini=iniparser_load(ini_path);
  if( ini ==NULL)
  {
    printf("inipar_load  failure\n");
    return -1;
  } 

  hostname = iniparser_getstring(ini, "mqtt_server_addr:host", DEFAULT_HOSTNAME);
  port     = iniparser_getint(ini,    "mqtt_server_addr:port", DEFAULT_PORT);
  username = iniparser_getstring(ini, "user_passwd:username", DEFAULT_USERNAME);
  passwd   = iniparser_getstring(ini, "user_passwd:passwd", DEFAULT_PASSWD);
  clientid = iniparser_getstring(ini, "client_id:id", DEFAULT_CLIENTID);
  Qos      = iniparser_getint(ini,    "ali_Qos:Qos", DEFAULT_QOS);

  sub_topic = iniparser_getstring(ini,  "sub_topic:topic", DEFAULT_SUBTOPIC);
  pub_topic   = iniparser_getstring(ini,"pub_topic:topic", DEFAULT_PUBTOPIC);

  mqtt->Qos=Qos;
  strncpy(mqtt->hostname, hostname, BUF_SIZE);
  mqtt->port = port;
  strncpy(mqtt->username, username, BUF_SIZE);
  strncpy(mqtt->passwd, passwd, BUF_SIZE);
  strncpy(mqtt->clientid, clientid, BUF_SIZE);
  strncpy(mqtt->sub_topic, sub_topic, BUF_SIZE);
  strncpy(mqtt->pub_topic, pub_topic, BUF_SIZE);

  iniparser_freedict(ini);
  
  return 0;
}










/*=======================================================================================
下面这三条指令是用于与上面三条区分编译系统为 C++ 或 C 的预处理指令相对应。用于指定
 extern "C" 链接指示符作用域，此处的"}"与上面的"{"相对应，为链接指示符作用结束符。
=======================================================================================*/
#ifdef __cplusplus
}
#endif
#include "iniparser.h"

/*
*****************************************************************************************
                                 本Ｃ语言源程序文件到此结束
*****************************************************************************************
*/



