/*!
 ***************************************************************************************
 *
 *  Copyright ? 2017-2018 yifneg. All Rights Reserved.
 *
 * \file      PingDeal.h
 * \author    yifeng
 * \version   1.0
 * \date      2023年3月16日
 * \brief     Ping处理头文件
 *
 *--------------------------------------------------------------------------------------
 * \attention
 *
 *
 ***************************************************************************************
 */

/*****************************************************************************************
 change history: 
    1.date  : 2023年3月16日
      author: yifeng
      change: create file

*****************************************************************************************/


/*=======================================================================================
下面两条指令是本头文件条件编译的预处理指令，用于防止本头文件被其他文件重复引用。
=======================================================================================*/
#ifndef __PingDeal_H__
#define __PingDeal_H__


/*========================================================================================
                                 本源程序包括的头文件                                     
建议：包含本项目的文件使用 #include "文件名.扩展名"，                                   
      包含系统库的文件使用 #include <文件名.扩展名> 。                                    
========================================================================================*/
#include "Main.h"


/*=======================================================================================
下面这三条指令是用于区分编译系统为 C++ 或 C 的预处理指令。                               
"__cplusplus" 为 C++ 预处理器名字，这三条指令表明接在其下面的那些指令为 C 程序特征.      
=======================================================================================*/
#ifdef __cplusplus
extern "C" {
#endif


/*=======================================================================================
                               系统运行的各类字符化常数定义                             
=======================================================================================*/
/*---------------------------------------------------------------------------------------
为了做到较好的软件可移植性，推荐用户在编程时使用下面定义的数据类型大小
---------------------------------------------------------------------------------------*/
#define ICMP_DATA_LEN 56          //ICMP默认数据长度
#define ICMP_HEAD_LEN 8           //ICMP默认头部长度
#define ICMP_LEN  (ICMP_DATA_LEN + ICMP_HEAD_LEN)
#define SEND_BUFFER_SIZE 128      //发送缓冲区大小
#define RECV_BUFFER_SIZE 128      //接收缓冲区大小
#define SEND_NUM 4                //发送报文数
#define MAX_WAIT_TIME 3
 
#define WAIT_TIME 5


/*---------------------------------------------------------------------------------------
的字符化常数定义：
----------------------------------------------------------------------------------------*/


/*=======================================================================================
                      各类字符化常数和硬件设计相关的输入／输出引脚定义
=======================================================================================*/
/*--------------------------------------------------------------------------------------
的输入／输出引脚定义：
--------------------------------------------------------------------------------------*/


/*======================================================================================
                             全局变量数据结构类型定义
======================================================================================*/
/*--------------------------------------------------------------------------------------
的全局数据结构类型定义 ：  
--------------------------------------------------------------------------------------*/
typedef struct 
{
  struct hostent *pHost;
  int    sock_icmp;
  int    nSend;
  char   *IP;
  int    nRecv; //实际接收到的报文数
  double min;
  double avg;
  double max;
  double mdev;

  char  SendBuffer[SEND_BUFFER_SIZE];
  char  RecvBuffer[RECV_BUFFER_SIZE];

  u8    Step;
  u16   Delay;
}PingDealStru;



/*=======================================================================================
                                         全局常量声明                                    
=======================================================================================*/
/*---------------------------------------------------------------------------------------
的全局常量声明：
---------------------------------------------------------------------------------------*/


/*=======================================================================================
                                         全局变量声明                                    
=======================================================================================*/
/*---------------------------------------------------------------------------------------
的全局变量声明：
---------------------------------------------------------------------------------------*/
extern PingDealStru gstvPing;

/*=======================================================================================
                                 源程序文件中的函数原型声明
=======================================================================================*/

/*!
 * \fn     Compute_cksum
 * \brief  校验
 *          
 * \param  [in] struct icmp *pIcmp   #
 * 
 * \retval u16
 */
u16 Compute_cksum(struct icmp *pIcmp);


/*!
 * \fn     SetICMP
 * \brief  设置ICMP
 *          
 * \param  [in] u16 seq   #
 * 
 * \retval void
 */
void SetICMP(u16 seq);


/*!
 * \fn     SendPacket
 * \brief  发送数据报
 *          
 * \param  [in] int sock_icmp                   #
 * \param  [in] struct sockaddr_in *dest_addr   #
 * \param  [in] int nSend                       #
 * 
 * \retval void
 */
void SendPacket(int sock_icmp, struct sockaddr_in *dest_addr, int nSend);



/*!
 * \fn     GetRtt
 * \brief  获得RTT
 *          
 * \param  [in] struct timeval *RecvTime   #
 * \param  [in] struct timeval *SendTime   #
 * 
 * \retval double
 */
double GetRtt(struct timeval *RecvTime, struct timeval *SendTime);


/*!
 * \fn     unpack
 * \brief  解析报文
 *          
 * \param  [in] struct timeval *RecvTime   #
 * 
 * \retval int
 */
int unpack(struct timeval *RecvTime);

/*!
 * \fn     Statistics
 * \brief  参数
 *          
 * 
 * \retval int
 */
int Statistics(void);


/*!
 * \fn     RecvePacket
 * \brief  接收数据包
 *          
 * \param  [in] int sock_icmp                   #
 * \param  [in] struct sockaddr_in *dest_addr   #
 * 
 * \retval int
 */
int RecvePacket(int sock_icmp, struct sockaddr_in *dest_addr);

/*!
 * \fn     PingDealHanle
 * \brief  Ping处理函数
 *          
 * \param  [in] char *ip   # 输入IP地址
 * 
 * \retval int
 */
int PingDealHanle(char *ip);

/*!
 * \fn     PingDealParaInit
 * \brief  参数初始化
 *          
 * \param  [in] void   #
 * 
 * \retval void
 */
void PingDealParaInit(void);


/*=======================================================================================
下面这三条指令是用于与上面三条区分编译系统为 C++ 或 C 的预处理指令相对应。用于指定
 extern "C" 链接指示符作用域，此处的"}"与上面的"{"相对应，为链接指示符作用结束符。
=======================================================================================*/
#ifdef __cplusplus
}
#endif

#endif
/*
*****************************************************************************************
                                 本Ｃ语言源程序文件到此结束
*****************************************************************************************
*/


